/**
  ******************************************************************************
  * @file    Delay.h
  * @author  李航兵
  * @version V1.2
  * @date    7-July-2018
  * @brief   这个文档包含了STM8S103F3P6的定时控制功能
  ******************************************************************************
  * @attention
  *          Tim4将被用于定时
  *			 将使用enableInterrupts()开启中断总开关，该函数在stm8s.h中，使用此函数开启中断后才有用
  * @更新说明：
  *		支持us、ms级延时，且精度大大提高
  * @下次更新预知：
  *		OS的移植
  ******************************************************************************
  */


/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __DELAY_H
#define __DELAY_H


/* Includes ------------------------------------------------------------------*/
#include "stm8s_clk.h"
#include "stm8s_tim4.h"
#include "stm8s_it.h"

/* Exported variables ------------------------------------------------------- */
/* Exported types ------------------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/
/* Exported macros -----------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/



/* Exported functions ------------------------------------------------------- */




void Delay_Init();              //延时系统初始化
void Delay_us(u16 us);		//微秒级延时，范围：1~65535
void Delay_Ms(u16 ms);           //毫秒延时，范围：1~65535




#endif /* __DELAY_H */

/************************ (C) COPYRIGHT 李航兵 *****END OF FILE****/